RT-Thread/rt-thread/bsp/gd32/arm/gd32527I-eval/board/gd32f5xx_libopt.h
/*!
    \file  gd32f5xx_libopt.h
    \brief library optional for gd32f5xx
*/

/*
    Copyright (C) 2016 GigaDevice

    2016-10-19, V1.0.0, firmware for GD32F5xx
*/

#ifndef GD32F5XX_LIBOPT_H
#define GD32F5XX_LIBOPT_H
#include "gd32f5xx_rcu.h"
#include "gd32f5xx_adc.h"
#include "gd32f5xx_can.h"
#include "gd32f5xx_crc.h"
#include "gd32f5xx_ctc.h"
#include "gd32f5xx_dac.h"
#include "gd32f5xx_dbg.h"
#include "gd32f5xx_dci.h"
#include "gd32f5xx_dma.h"
#include "gd32f5xx_enet.h"
#include "gd32f5xx_exmc.h"
#include "gd32f5xx_exti.h"
#include "gd32f5xx_fmc.h"
#include "gd32f5xx_fwdgt.h"
#include "gd32f5xx_gpio.h"
#include "gd32f5xx_syscfg.h"
#include "gd32f5xx_i2c.h"
#include "gd32f5xx_ipa.h"
#include "gd32f5xx_iref.h"
#include "gd32f5xx_pmu.h"
#include "gd32f5xx_rcu.h"
#include "gd32f5xx_rtc.h"
#include "gd32f5xx_sdio.h"
#include "gd32f5xx_spi.h"
#include "gd32f5xx_timer.h"
#include "gd32f5xx_tli.h"
#include "gd32f5xx_trng.h"
#include "gd32f5xx_usart.h"
#include "gd32f5xx_wwdgt.h"
#include "gd32f5xx_misc.h"

#endif /* GD32F5XX_LIBOPT_H */
